# C++
ms-vscode.cpptools
ms-vscode.cmake-tools
twxs.cmake
ms-vscode.cpptools-extension-pack

# Python
ms-python.python
ms-python.black-formatter
ms-python.isort
charliermarsh.ruff

# Jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Git
eamodio.gitlens
mhutchie.git-graph

# Productivity
ms-vscode-remote.vscode-remote-extensionpack
streetsidesoftware.code-spell-checker
gruntfuggly.todo-tree
usernamehw.errorlens
PKief.material-icon-theme